# Labs solutions

In this project I will present my solutions to the labs from the SQL course of University of New York on EDX platform, using the my_guitar_shop database

In [1]:
%load_ext sql

In [15]:
pip install mysqlclient

Collecting mysqlclient
  Downloading mysqlclient-2.1.0-cp38-cp38-win_amd64.whl (180 kB)
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.1.0
Note: you may need to restart the kernel to use updated packages.

In [2]:
%sql mysql://root:Ekonomiks1983@localhost/my_guitar_shop

Showing tables of the database

In [88]:
%sql SHOW TABLES;

 * mysql://root:***@localhost/my_guitar_shop
13 rows affected.

[('addresses',),
 ('administrators',),
 ('best_products',),
 ('bill_addresses',),
 ('categories',),
 ('customer_addresses',),
 ('customers',),
 ('order_item_products',),
 ('order_items',),
 ('orders',),
 ('product_summary',),
 ('products',),
 ('ship_addresses',)]

Write a SELECT statement that returns four columns from the Products table: 

product_code, product_name, list_price, and discount_percent.

Add an ORDER BY clause to this statement that sorts the result set by list 
price in descending sequence.

In [3]:
%%sql SELECT product_code, product_name, list_price, discount_percent
FROM products
ORDER BY list_price DESC;

 * mysql://root:***@localhost/my_guitar_shop
11 rows affected.

[('sg', 'Gibson SG', Decimal('2517.00'), Decimal('52.00')),
 ('les_paul', 'Gibson Les Paul', Decimal('1199.00'), Decimal('30.00')),
 ('precision', 'Fender Precision', Decimal('799.99'), Decimal('30.00')),
 ('tama', 'Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), Decimal('15.00')),
 ('dgx_640', 'Yamaha DGX 640 88-Key Digital Piano', Decimal('799.99'), Decimal('0.00')),
 ('ludwig', 'Ludwig 5-piece Drum Set with Cymbals', Decimal('699.99'), Decimal('30.00')),
 ('strat', 'Fender Stratocaster', Decimal('699.00'), Decimal('35.00')),
 ('hofner', 'Hofner Icon', Decimal('499.99'), Decimal('25.00')),
 ('fg700s', 'Yamaha FG700S', Decimal('489.99'), Decimal('38.00')),
 ('rodriguez', 'Rodriguez Caballero 11', Decimal('415.00'), Decimal('39.00')),
 ('washburn', 'Washburn D10S', Decimal('299.00'), Decimal('0.00'))]

Write a SELECT statement that returns three columns from the Customers table 
named first_name, last_name and full_name that combines the last_name and first_name columns

In [4]:
%%sql SELECT first_name, last_name,
CONCAT(last_name, ', ', first_name) AS full_name
FROM customers
WHERE last_name BETWEEN 'M' AND 'Z'
ORDER BY last_name;

 * mysql://root:***@localhost/my_guitar_shop
4 rows affected.

[('Rick', 'Raven', 'Raven, Rick'),
 ('Al', 'Sherwood', 'Sherwood, Al'),
 ('Erin', 'Valentino', 'Valentino, Erin'),
 ('Frank Lee', 'Wilson', 'Wilson, Frank Lee')]

Write a SELECT statement that returns these columns from the Products table:
1. product_name: The product_name column
2. list_price: The list_price column
3. date_added: The date_added column

Return only the rows with a list price that’s greater than 500 and less than 2000.
Sort the result set by the date_added column in descending sequence

In [5]:
%%sql SELECT product_name, list_price, date_added
FROM products
WHERE list_price BETWEEN 500 AND 2000
ORDER BY date_added DESC;

 * mysql://root:***@localhost/my_guitar_shop
6 rows affected.

[('Yamaha DGX 640 88-Key Digital Piano', Decimal('799.99'), datetime.datetime(2022, 6, 13, 21, 5)),
 ('Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), datetime.datetime(2018, 7, 30, 13, 14, 15)),
 ('Ludwig 5-piece Drum Set with Cymbals', Decimal('699.99'), datetime.datetime(2018, 7, 30, 12, 46, 40)),
 ('Fender Precision', Decimal('799.99'), datetime.datetime(2018, 6, 1, 11, 29, 35)),
 ('Gibson Les Paul', Decimal('1199.00'), datetime.datetime(2017, 12, 5, 16, 33, 13)),
 ('Fender Stratocaster', Decimal('699.00'), datetime.datetime(2017, 10, 30, 9, 32, 40))]

Write a SELECT statement that returns these column names and data from the Products table:
1. product_name: The product_name column.
2. list_price: The list_price column.
3. discount_percent: The discount_percent column.
4. discount_amount: A column that’s calculated from the previous two columns
5. discount_price: A column that’s calculated from the previous three columns

Round the discount_amount and discount_price columns to 2 decimal places.
Sort the result set by the discount_price column in descending sequence.
Use the LIMIT clause so the result set contains only the first 5 rows.

In [6]:
%%sql SELECT product_name, list_price, discount_percent, 
		ROUND((list_price * discount_percent / 100),2) AS discount_amount,
        ROUND((list_price - (list_price * discount_percent / 100)),2) AS discount_price
FROM products
ORDER BY discount_price DESC
LIMIT 5;

 * mysql://root:***@localhost/my_guitar_shop
5 rows affected.

[('Gibson SG', Decimal('2517.00'), Decimal('52.00'), Decimal('1308.84'), Decimal('1208.16')),
 ('Gibson Les Paul', Decimal('1199.00'), Decimal('30.00'), Decimal('359.70'), Decimal('839.30')),
 ('Yamaha DGX 640 88-Key Digital Piano', Decimal('799.99'), Decimal('0.00'), Decimal('0.00'), Decimal('799.99')),
 ('Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), Decimal('15.00'), Decimal('120.00'), Decimal('679.99')),
 ('Fender Precision', Decimal('799.99'), Decimal('30.00'), Decimal('240.00'), Decimal('559.99'))]

Write a SELECT statement that returns these column names and data from the Order_Items table:
1. item_id 
2. item_price: The item_price column
3. discount_amount: The discount_amount column
4. quantity: The quantity column
5. price_total: A column that’s calculated by multiplying the item price by the quantity
6. discount_total: A column that’s calculated by multiplying the discount amount by the quantity
7. item_total: A column that’s calculated by subtracting the discount amount from the item price and then multiplying by the quantity.

Only return rows where the item_total is greater than 500.
Sort the result set by the item_total column in descending sequence

In [7]:
%%sql SELECT item_id, item_price, discount_amount, quantity,
		item_price * quantity AS price_total,
        discount_amount * quantity AS discount_total,
        item_price - discount_amount AS item_total
FROM order_items
WHERE item_price - discount_amount > 500
ORDER BY item_total DESC;

 * mysql://root:***@localhost/my_guitar_shop
5 rows affected.

[(3, Decimal('2517.00'), Decimal('1308.84'), 1, Decimal('2517.00'), Decimal('1308.84'), Decimal('1208.16')),
 (1, Decimal('1199.00'), Decimal('359.70'), 1, Decimal('1199.00'), Decimal('359.70'), Decimal('839.30')),
 (5, Decimal('1199.00'), Decimal('359.70'), 2, Decimal('2398.00'), Decimal('719.40'), Decimal('839.30')),
 (11, Decimal('799.99'), Decimal('120.00'), 1, Decimal('799.99'), Decimal('120.00'), Decimal('679.99')),
 (9, Decimal('799.99'), Decimal('240.00'), 1, Decimal('799.99'), Decimal('240.00'), Decimal('559.99'))]

Write a SELECT statement that returns these columns from the Orders table:
1. order_id: The order_id column
2. order_date: The order_date column
3. ship_date: The ship_date column

Return only the rows where the ship_date column contains a null value.
Sort the result set by the order_id column in descending sequence.

In [8]:
%%sql SELECT order_id, order_date, ship_date
FROM orders 
WHERE ship_date IS NULL
ORDER BY order_id DESC;

 * mysql://root:***@localhost/my_guitar_shop
3 rows affected.

[(9, datetime.datetime(2018, 4, 3, 12, 22, 31), None),
 (8, datetime.datetime(2018, 4, 2, 11, 26, 38), None),
 (6, datetime.datetime(2018, 3, 31, 18, 37, 22), None)]

Write a SELECT statement without a FROM clause that creates a row with these columns:
1. price 100 (dollars)
2. tax_rate .07 (7 percent)
3. tax_amount: The price multiplied by the tax
4. total: The price plus the tax

To calculate the fourth column, add the expressions you used for the first and third columns

In [9]:
%%sql SELECT 'price (dollars)' AS id, 100 AS val
UNION
SELECT 'tax_rate (7 percent)' AS id, 0.07 AS val
UNION
SELECT 'tax_amount' AS id, 0.07 * 100 AS val
UNION
SELECT 'total' AS id, 100 + (0.07 * 100)

 * mysql://root:***@localhost/my_guitar_shop
4 rows affected.

[('price (dollars)', Decimal('100.00')),
 ('tax_rate (7 percent)', Decimal('0.07')),
 ('tax_amount', Decimal('7.00')),
 ('total', Decimal('107.00'))]

Write a SELECT statement that joins the Categories table to the Products table and returns 
these columns: category_name, product_name, list_price.
Sort the result set by the category_name column and then by the product_name column 
in ascending sequence.

In [10]:
%%sql SELECT category_name, product_name, list_price
FROM categories
JOIN products
	ON categories.category_id = products.category_id
ORDER BY product_name;

 * mysql://root:***@localhost/my_guitar_shop
11 rows affected.

[('Basses', 'Fender Precision', Decimal('799.99')),
 ('Guitars', 'Fender Stratocaster', Decimal('699.00')),
 ('Guitars', 'Gibson Les Paul', Decimal('1199.00')),
 ('Guitars', 'Gibson SG', Decimal('2517.00')),
 ('Basses', 'Hofner Icon', Decimal('499.99')),
 ('Woodwinds', 'Ludwig 5-piece Drum Set with Cymbals', Decimal('699.99')),
 ('Guitars', 'Rodriguez Caballero 11', Decimal('415.00')),
 ('Woodwinds', 'Tama 5-Piece Drum Set with Cymbals', Decimal('799.99')),
 ('Guitars', 'Washburn D10S', Decimal('299.00')),
 ('Keyboards', 'Yamaha DGX 640 88-Key Digital Piano', Decimal('799.99')),
 ('Guitars', 'Yamaha FG700S', Decimal('489.99'))]

Write a SELECT statement that joins the Customers table to the Addresses table and returns 
these columns: first_name, last_name, line1, city, state, zip_code.
Return one row for each address for the customer with an email address of allan.sherwood@yahoo.com
Sort the result set by the zip_code column in ascending sequence

In [11]:
%%sql SELECT first_name, last_name, line1, city, state, zip_code
FROM customers JOIN addresses
	ON customers.customer_id = addresses.customer_id
WHERE customers.email_address = 'allan.sherwood@yahoo.com'
ORDER BY zip_code;

 * mysql://root:***@localhost/my_guitar_shop
2 rows affected.

[('Al', 'Sherwood', '100 East Ridgewood Ave.', 'Paramus', 'NJ', '07652'),
 ('Al', 'Sherwood', '21 Rosewood Rd.', 'Woodcliff Lake', 'NJ', '07677')]

Write a SELECT statement that joins the Customers table to the Addresses table and returns these 
columns: first_name, last_name, line1, city, state, zip_code.
Return one row for each customer, but only return addresses that are the shipping address 
for a customer.
Sort the result set by the zip_code column in ascending sequence

In [13]:
%%sql SELECT first_name, last_name, line1, city, state, zip_code
FROM customers JOIN addresses
	ON customers.customer_id = addresses.customer_id
	AND customers.shipping_address_id = addresses.address_id
ORDER BY zip_code;

 * mysql://root:***@localhost/my_guitar_shop
8 rows affected.

[('Al', 'Sherwood', '100 East Ridgewood Ave.', 'Paramus', 'NJ', '07652'),
 ('Gary', 'Hernandez', '7361 N. 41st St.', 'New York', 'NY', '10012'),
 ('Barry', 'Zimmer', '16285 Wendell St.', 'Omaha', 'NE', '68135'),
 ('Frank Lee', 'Wilson', '23 Mountain View St.', 'Denver', 'CO', '80208'),
 ('Heather', 'Esway', '2381 Buena Vista St.', 'Los Angeles', 'CA', '90023'),
 ('Erin', 'Valentino', '6982 Palm Ave.', 'Fresno', 'CA', '93711'),
 ('David', 'Goldstein', '186 Vermont St.', 'San Francisco', 'CA', '94110'),
 ('Christine', 'Brown', '19270 NW Cornell Rd.', 'Beaverton', 'OR', '97006')]

Write a SELECT statement that joins the Customers, Orders, Order_Items, and Products tables. 
This statement should return these columns: last_name, first_name, order_date, product_name, 
item_price, discount_amount, and quantity.
Use aliases for the tables.
Sort the final result set by the last_name, order_date, and product_name columns.

In [14]:
%%sql SELECT last_name, first_name, order_date, product_name, 
		item_price, discount_amount, quantity
FROM customers c
JOIN orders o
	ON c.customer_id = o.customer_id
JOIN order_items oi
	ON o.order_id = oi.order_id
JOIN products p
	ON oi.product_id = p.product_id
ORDER BY last_name, order_date, product_name;

 * mysql://root:***@localhost/my_guitar_shop
12 rows affected.

[('Brown', 'Christine', datetime.datetime(2018, 3, 30, 15, 22, 31), 'Gibson Les Paul', Decimal('1199.00'), Decimal('359.70'), 2),
 ('Goldstein', 'David', datetime.datetime(2018, 3, 31, 5, 43, 11), 'Washburn D10S', Decimal('299.00'), Decimal('0.00'), 1),
 ('Goldstein', 'David', datetime.datetime(2018, 4, 3, 12, 22, 31), 'Fender Stratocaster', Decimal('699.00'), Decimal('209.70'), 1),
 ('Hernandez', 'Gary', datetime.datetime(2018, 4, 2, 11, 26, 38), 'Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), Decimal('120.00'), 1),
 ('Sherwood', 'Al', datetime.datetime(2018, 3, 28, 9, 40, 28), 'Gibson Les Paul', Decimal('1199.00'), Decimal('359.70'), 1),
 ('Sherwood', 'Al', datetime.datetime(2018, 3, 29, 9, 44, 58), 'Gibson SG', Decimal('2517.00'), Decimal('1308.84'), 1),
 ('Sherwood', 'Al', datetime.datetime(2018, 3, 29, 9, 44, 58), 'Rodriguez Caballero 11', Decimal('415.00'), Decimal('161.85'), 1),
 ('Valentino', 'Erin', datetime.datetime(2018, 3, 31, 18, 37, 22), 'Washburn D10S', Decimal('299.00'), Decimal('0.00'), 1),
 ('Wilson', 'Frank Lee', datetime.datetime(2018, 4, 1, 23, 11, 12), 'Fender Precision', Decimal('799.99'), Decimal('240.00'), 1),
 ('Wilson', 'Frank Lee', datetime.datetime(2018, 4, 1, 23, 11, 12), 'Fender Stratocaster', Decimal('699.00'), Decimal('209.70'), 1),
 ('Wilson', 'Frank Lee', datetime.datetime(2018, 4, 1, 23, 11, 12), 'Ludwig 5-piece Drum Set with Cymbals', Decimal('699.99'), Decimal('210.00'), 1),
 ('Zimmer', 'Barry', datetime.datetime(2018, 3, 28, 11, 23, 20), 'Yamaha FG700S', Decimal('489.99'), Decimal('186.20'), 1)]

Use the UNION operator to generate a result set consisting of three columns from the Orders table:
1. ship_status A calculated column that contains a value of SHIPPED or NOT SHIPPED
2. order_id The order_id column
3. order_date The order_date column
If the order has a value in the ship_date column, the ship_status column should contain a value of 
SHIPPED. Otherwise, it should contain a value of NOT SHIPPED.
Sort the final result set by the order_date column

In [15]:
%%sql SELECT 'SHIPPED' AS ship_status, order_id, order_date
FROM orders
WHERE ship_date IS NOT NULL
UNION
SELECT 'NOT SHIPPED' AS ship_status, order_id, order_date
FROM orders
WHERE ship_date IS NULL
ORDER BY order_date;

 * mysql://root:***@localhost/my_guitar_shop
9 rows affected.

[('SHIPPED', 1, datetime.datetime(2018, 3, 28, 9, 40, 28)),
 ('SHIPPED', 2, datetime.datetime(2018, 3, 28, 11, 23, 20)),
 ('SHIPPED', 3, datetime.datetime(2018, 3, 29, 9, 44, 58)),
 ('SHIPPED', 4, datetime.datetime(2018, 3, 30, 15, 22, 31)),
 ('SHIPPED', 5, datetime.datetime(2018, 3, 31, 5, 43, 11)),
 ('NOT SHIPPED', 6, datetime.datetime(2018, 3, 31, 18, 37, 22)),
 ('SHIPPED', 7, datetime.datetime(2018, 4, 1, 23, 11, 12)),
 ('NOT SHIPPED', 8, datetime.datetime(2018, 4, 2, 11, 26, 38)),
 ('NOT SHIPPED', 9, datetime.datetime(2018, 4, 3, 12, 22, 31))]

Write a SELECT statement that returns these columns:
1. The count of the number of orders in the Orders table named order_count
2. The sum of the tax_amount columns in the Orders table named tax_total
3. The average of the tax_amount columns in the Orders table named tax_average

In [16]:
%%sql SELECT COUNT(*) AS order_count,
		SUM(tax_amount) AS tax_total,
        AVG(tax_amount) AS tax_average
FROM orders;

 * mysql://root:***@localhost/my_guitar_shop
1 rows affected.

[(9, Decimal('122.24'), Decimal('13.582222'))]

Write a SELECT statement that returns one row for each category that has products with these columns:
1. The category_name column from the Categories table
2. The count of the products in the Products table aliased as product_count
3. The list price of the most expensive product in the Products table aliased as most_expensive_product

Sort the result set so the category with the most products appears first.

In [17]:
%%sql SELECT category_name ,
		COUNT(*) AS product_count,
        MAX(list_price) AS most_expensive_product 
FROM categories JOIN products
	ON categories.category_id = products.category_id
GROUP BY category_name
ORDER BY product_count DESC;

 * mysql://root:***@localhost/my_guitar_shop
4 rows affected.

[('Guitars', 6, Decimal('2517.00')),
 ('Basses', 2, Decimal('799.99')),
 ('Woodwinds', 2, Decimal('799.99')),
 ('Keyboards', 1, Decimal('799.99'))]

Write a SELECT statement that returns one row for each customer that has orders with these columns:
1. The email_address column from the Customers table
2. The sum of the item price in the Order_Items table multiplied by the quantity in the Order_Items table aliased as item_price_total
3. The sum of the discount amount column in the Order_Items table multiplied by the quantity in the Order_Items table aliased as discount_amount_total

Sort the result set in descending sequence by the item price total for each customer.

In [18]:
%%sql SELECT email_address,
		SUM(item_price * quantity) AS item_price_total,
        SUM(discount_amount * quantity) AS discount_amount_total
FROM customers 
JOIN orders ON customers.customer_id = orders.customer_id 
JOIN order_items ON orders.order_id = order_items.order_id
GROUP BY email_address
ORDER BY item_price_total DESC;

 * mysql://root:***@localhost/my_guitar_shop
7 rows affected.

[('allan.sherwood@yahoo.com', Decimal('4131.00'), Decimal('1830.39')),
 ('christineb@solarone.com', Decimal('2398.00'), Decimal('719.40')),
 ('frankwilson@sbcglobal.net', Decimal('2198.98'), Decimal('659.70')),
 ('david.goldstein@hotmail.com', Decimal('998.00'), Decimal('209.70')),
 ('gary_hernandez@yahoo.com', Decimal('799.99'), Decimal('120.00')),
 ('barryz@gmail.com', Decimal('489.99'), Decimal('186.20')),
 ('erinv@gmail.com', Decimal('299.00'), Decimal('0.00'))]

Write a SELECT statement that returns one row for each customer that has orders with these columns:
1. The email_address column from the Customers table
2. A count of the number of orders aliased as order_count
3. The total amount for each order aliased as order_total (Hint: First, subtract the discount amount from the price. Then, multiply by the quantity.)

Return only those rows where the customer has more than 1 order.
Sort the result set in descending sequence by the sum of the line item amounts.

In [19]:
%%sql SELECT email_address,
		COUNT(orders.order_id) AS order_count,
        SUM((item_price - discount_amount) * quantity) AS order_total
FROM customers 
JOIN orders ON customers.customer_id = orders.customer_id 
JOIN order_items ON orders.order_id = order_items.order_id
GROUP BY email_address
HAVING order_count > 1
ORDER BY order_total DESC;

 * mysql://root:***@localhost/my_guitar_shop
3 rows affected.

[('allan.sherwood@yahoo.com', 3, Decimal('2300.61')),
 ('frankwilson@sbcglobal.net', 3, Decimal('1539.28')),
 ('david.goldstein@hotmail.com', 2, Decimal('788.30'))]

Modify the solution to lab 4 (the query in the previous cell) so it only counts and totals line items that have an item_price value that’s greater than 400.

In [20]:
%%sql SELECT email_address,
		COUNT(orders.order_id) AS order_count,
        SUM((item_price - discount_amount) * quantity) AS order_total
FROM customers 
JOIN orders ON customers.customer_id = orders.customer_id 
JOIN order_items ON orders.order_id = order_items.order_id
WHERE item_price > 400
GROUP BY email_address
HAVING order_count > 1
ORDER BY order_total DESC;

 * mysql://root:***@localhost/my_guitar_shop
2 rows affected.

[('allan.sherwood@yahoo.com', 3, Decimal('2300.61')),
 ('frankwilson@sbcglobal.net', 3, Decimal('1539.28'))]

Write a SELECT statement that answers this question: Which products have a list price that’s greater than the average list price for all products? Return the prodcut_id, product_name and list_price columns for each product. Sort the result set by the list_price column in descending sequence.

In [21]:
%%sql SELECT product_id, product_name, list_price
FROM products
WHERE list_price >
	(	SELECT AVG(list_price)
		FROM products    )
ORDER BY list_price DESC;

 * mysql://root:***@localhost/my_guitar_shop
2 rows affected.

[(3, 'Gibson SG', Decimal('2517.00')),
 (2, 'Gibson Les Paul', Decimal('1199.00'))]

Write a SELECT statement that returns three columns: email_address, order_id, 
and the order total for each customer. 

To do this, you can group the result set by the email_address and order_id columns. 
In addition, you must calculate 
the order total from the columns in the Order_Items table.

In [22]:
%%sql SELECT email_address, o.order_id, 
		SUM((item_price - discount_amount) * quantity) AS order_total
FROM customers c 
JOIN orders o ON c.customer_id = o.customer_id
JOIN order_items oi ON o.order_id = oi.order_id
GROUP BY email_address, o.order_id;

 * mysql://root:***@localhost/my_guitar_shop
9 rows affected.

[('allan.sherwood@yahoo.com', 1, Decimal('839.30')),
 ('allan.sherwood@yahoo.com', 3, Decimal('1461.31')),
 ('barryz@gmail.com', 2, Decimal('303.79')),
 ('christineb@solarone.com', 4, Decimal('1678.60')),
 ('david.goldstein@hotmail.com', 5, Decimal('299.00')),
 ('david.goldstein@hotmail.com', 9, Decimal('489.30')),
 ('erinv@gmail.com', 6, Decimal('299.00')),
 ('frankwilson@sbcglobal.net', 7, Decimal('1539.28')),
 ('gary_hernandez@yahoo.com', 8, Decimal('679.99'))]

Write a second SELECT statement that uses the first SELECT statement in its FROM clause. 
The main query should return three columns: the customer’s email address and the largest 
order (aliased as max_order_total) and the smallest order_id (aliased as min_order_id). 
To do this, you can group the result set by the email_address. 
ort the result set by the largest order in descending sequence.

In [23]:
%%sql SELECT email_address, MAX(order_total) AS max_order_total,
		MIN(order_id) AS min_order_id
FROM 
(
	SELECT email_address, o.order_id, 
		SUM((item_price - discount_amount) * quantity) AS order_total
	FROM customers c 
	JOIN orders o ON c.customer_id = o.customer_id
	JOIN order_items oi ON o.order_id = oi.order_id
	GROUP BY email_address, o.order_id
) t
GROUP BY email_address
ORDER BY max_order_total DESC;

 * mysql://root:***@localhost/my_guitar_shop
7 rows affected.

[('christineb@solarone.com', Decimal('1678.60'), 4),
 ('frankwilson@sbcglobal.net', Decimal('1539.28'), 7),
 ('allan.sherwood@yahoo.com', Decimal('1461.31'), 1),
 ('gary_hernandez@yahoo.com', Decimal('679.99'), 8),
 ('david.goldstein@hotmail.com', Decimal('489.30'), 5),
 ('barryz@gmail.com', Decimal('303.79'), 2),
 ('erinv@gmail.com', Decimal('299.00'), 6)]

Write a SELECT statement that returns the name, list_price and discount percent of 
each product that has a unique discount percent. In other words, don’t include products 
that have the same discount percent as another product.
Sort the result set by the product_name column

In [24]:
%%sql WITH discount_uniques AS
(
	SELECT discount_percent, COUNT(product_id) AS disc_count
    FROM products
    GROUP BY discount_percent
    HAVING disc_count = 1
)

SELECT product_name, list_price, discount_percent
FROM products
WHERE discount_percent IN
	(SELECT discount_percent
    FROM discount_uniques)
ORDER BY product_name;

 * mysql://root:***@localhost/my_guitar_shop
6 rows affected.

[('Fender Stratocaster', Decimal('699.00'), Decimal('35.00')),
 ('Gibson SG', Decimal('2517.00'), Decimal('52.00')),
 ('Hofner Icon', Decimal('499.99'), Decimal('25.00')),
 ('Rodriguez Caballero 11', Decimal('415.00'), Decimal('39.00')),
 ('Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), Decimal('15.00')),
 ('Yamaha FG700S', Decimal('489.99'), Decimal('38.00'))]

Use a correlated subquery to return one row per customer, representing the customer’s oldest order
(the one with the earliest date). Each row should include these three columns: email_address, 
oldest_order_id, and oldest_order_date. Only include customers who have placed an order.
Sort the result set by the oldest_order_date and oldest_order_id columns.

In [25]:
%%sql SELECT c.email_address, order_id AS oldest_order_id, OldestOrders.oldest_order_date
FROM customers c JOIN
	(SELECT o1.customer_id, min(o1.order_date) AS oldest_order_date
	FROM orders o1
	GROUP BY o1.customer_id) AS OldestOrders
ON c.customer_id = OldestOrders.customer_id
JOIN Orders oID
ON OldestOrders.oldest_order_date = oID.order_date;

 * mysql://root:***@localhost/my_guitar_shop
7 rows affected.

[('allan.sherwood@yahoo.com', 1, datetime.datetime(2018, 3, 28, 9, 40, 28)),
 ('barryz@gmail.com', 2, datetime.datetime(2018, 3, 28, 11, 23, 20)),
 ('christineb@solarone.com', 4, datetime.datetime(2018, 3, 30, 15, 22, 31)),
 ('david.goldstein@hotmail.com', 5, datetime.datetime(2018, 3, 31, 5, 43, 11)),
 ('erinv@gmail.com', 6, datetime.datetime(2018, 3, 31, 18, 37, 22)),
 ('frankwilson@sbcglobal.net', 7, datetime.datetime(2018, 4, 1, 23, 11, 12)),
 ('gary_hernandez@yahoo.com', 8, datetime.datetime(2018, 4, 2, 11, 26, 38))]

Write a SELECT statement that returns these columns from the Products table:

1. The list_price column
2. A column that uses the FORMAT function to return the list_price column with 1 digit to the right of the decimal point.  Name this column price_format
3. A column that uses the CONVERT function to return the list_price column as an integer. Name this column price_convert
4. A column that uses the CAST function to return the list_price column as an integer.  Name this column price_cast

Sort the result set by the list_price column in ascending sequence.

In [26]:
%%sql SELECT list_price, FORMAT(list_price,1) AS price_format,
	CONVERT(list_price , SIGNED) AS price_convert,
    CAST(list_price AS SIGNED) AS price_cast
FROM products
ORDER BY list_price;

 * mysql://root:***@localhost/my_guitar_shop
11 rows affected.

[(Decimal('299.00'), '299.0', 299, 299),
 (Decimal('415.00'), '415.0', 415, 415),
 (Decimal('489.99'), '490.0', 490, 490),
 (Decimal('499.99'), '500.0', 500, 500),
 (Decimal('699.00'), '699.0', 699, 699),
 (Decimal('699.99'), '700.0', 700, 700),
 (Decimal('799.99'), '800.0', 800, 800),
 (Decimal('799.99'), '800.0', 800, 800),
 (Decimal('799.99'), '800.0', 800, 800),
 (Decimal('1199.00'), '1,199.0', 1199, 1199),
 (Decimal('2517.00'), '2,517.0', 2517, 2517)]

Write a SELECT statement that returns these columns from the Products table:
1. The date_added column
2. A column that uses the CAST function to return the date_added column with its date only (year, month, and day). Name this column added_date
3. A column that uses the CAST function to return the date_added column with just the year and the month.  Name this column added_char7
4. A column that uses the CAST function to return the date_added column with its full time only (hour, minutes, and seconds). Name this column added_time

Sort the result set by the date_added column in ascending sequence.

In [27]:
%%sql SELECT date_added, CAST(date_added AS DATE) AS added_date,
	CAST(date_added AS CHAR(7)) AS added_char7,
    CAST(date_added AS TIME) AS added_time
FROM products
ORDER BY date_added;

 * mysql://root:***@localhost/my_guitar_shop
11 rows affected.

[(datetime.datetime(2017, 10, 30, 9, 32, 40), datetime.date(2017, 10, 30), '2017-10', datetime.timedelta(seconds=34360)),
 (datetime.datetime(2017, 12, 5, 16, 33, 13), datetime.date(2017, 12, 5), '2017-12', datetime.timedelta(seconds=59593)),
 (datetime.datetime(2018, 2, 4, 11, 4, 31), datetime.date(2018, 2, 4), '2018-02', datetime.timedelta(seconds=39871)),
 (datetime.datetime(2018, 6, 1, 11, 12, 59), datetime.date(2018, 6, 1), '2018-06', datetime.timedelta(seconds=40379)),
 (datetime.datetime(2018, 6, 1, 11, 29, 35), datetime.date(2018, 6, 1), '2018-06', datetime.timedelta(seconds=41375)),
 (datetime.datetime(2018, 7, 30, 12, 46, 40), datetime.date(2018, 7, 30), '2018-07', datetime.timedelta(seconds=46000)),
 (datetime.datetime(2018, 7, 30, 13, 14, 15), datetime.date(2018, 7, 30), '2018-07', datetime.timedelta(seconds=47655)),
 (datetime.datetime(2018, 7, 30, 13, 58, 35), datetime.date(2018, 7, 30), '2018-07', datetime.timedelta(seconds=50315)),
 (datetime.datetime(2018, 7, 30, 14, 12, 41), datetime.date(2018, 7, 30), '2018-07', datetime.timedelta(seconds=51161)),
 (datetime.datetime(2018, 7, 30, 14, 18, 33), datetime.date(2018, 7, 30), '2018-07', datetime.timedelta(seconds=51513)),
 (datetime.datetime(2022, 6, 13, 21, 5), datetime.date(2022, 6, 13), '2022-06', datetime.timedelta(seconds=75900))]

Write a SELECT statement that returns these columns from the Products table:
1. The list_price column
2. The discount_percent column
3. A column named discount_amount that uses the previous two columns to calculate the discount amount and uses the ROUND function to round the result so it has 2 decimal digits.

Sort the result set by the discount_amount column in ascending sequence.

In [28]:
%%sql SELECT list_price, discount_percent ,
	ROUND(list_price * discount_percent, 2) AS discount_amount
FROM products
ORDER BY discount_amount;

 * mysql://root:***@localhost/my_guitar_shop
11 rows affected.

[(Decimal('299.00'), Decimal('0.00'), Decimal('0.00')),
 (Decimal('799.99'), Decimal('0.00'), Decimal('0.00')),
 (Decimal('799.99'), Decimal('15.00'), Decimal('11999.85')),
 (Decimal('499.99'), Decimal('25.00'), Decimal('12499.75')),
 (Decimal('415.00'), Decimal('39.00'), Decimal('16185.00')),
 (Decimal('489.99'), Decimal('38.00'), Decimal('18619.62')),
 (Decimal('699.99'), Decimal('30.00'), Decimal('20999.70')),
 (Decimal('799.99'), Decimal('30.00'), Decimal('23999.70')),
 (Decimal('699.00'), Decimal('35.00'), Decimal('24465.00')),
 (Decimal('1199.00'), Decimal('30.00'), Decimal('35970.00')),
 (Decimal('2517.00'), Decimal('52.00'), Decimal('130884.00'))]

Write a SELECT statement that returns these columns from the Orders table:
1. The order_date column
2. A column that uses the DATE_FORMAT function to return the four-digit year that’s stored in the order_date column.  Alias the column order_year
3. A column that uses the DATE_FORMAT function to return the order_date column in this format: Mon-DD-YYYY. In other words, use abbreviated months and separate each date component with dashes. Alias the column order_date_formatted.
4. A column that uses the DATE_FORMAT function to return the order_date column with only the hours and minutes on a 12-hour clock with an am/pm indicator. Alias the column order_time
5. A column that uses the DATE_FORMAT function to return the order_date column in this format: MM/DD/YY HH:MM. In other words, use two-digit months, days, and years and separate them by slashes. Use 2-digit hours and minutes on a 24-hour clock. And use leading zeros for all date/time components. Alias the column  order_datetime

Sort the result set by the order_date column in ascending sequence.

In [31]:
%%sql SELECT order_date,
	DATE_FORMAT(order_date, "%Y") AS order_year,
    DATE_FORMAT(order_date, '%b-%e-%Y') AS order_date_formatted,
    DATE_FORMAT(order_date, '%r') AS order_time,
    DATE_FORMAT(order_date, '%m/%d/%y %H:%i') AS order_datetime
FROM orders
ORDER BY order_date;

 * mysql://root:***@localhost/my_guitar_shop
9 rows affected.

[(datetime.datetime(2018, 3, 28, 9, 40, 28), '2018', 'Mar-28-2018', '09:40:28 AM', '03/28/18 09:40'),
 (datetime.datetime(2018, 3, 28, 11, 23, 20), '2018', 'Mar-28-2018', '11:23:20 AM', '03/28/18 11:23'),
 (datetime.datetime(2018, 3, 29, 9, 44, 58), '2018', 'Mar-29-2018', '09:44:58 AM', '03/29/18 09:44'),
 (datetime.datetime(2018, 3, 30, 15, 22, 31), '2018', 'Mar-30-2018', '03:22:31 PM', '03/30/18 15:22'),
 (datetime.datetime(2018, 3, 31, 5, 43, 11), '2018', 'Mar-31-2018', '05:43:11 AM', '03/31/18 05:43'),
 (datetime.datetime(2018, 3, 31, 18, 37, 22), '2018', 'Mar-31-2018', '06:37:22 PM', '03/31/18 18:37'),
 (datetime.datetime(2018, 4, 1, 23, 11, 12), '2018', 'Apr-1-2018', '11:11:12 PM', '04/01/18 23:11'),
 (datetime.datetime(2018, 4, 2, 11, 26, 38), '2018', 'Apr-2-2018', '11:26:38 AM', '04/02/18 11:26'),
 (datetime.datetime(2018, 4, 3, 12, 22, 31), '2018', 'Apr-3-2018', '12:22:31 PM', '04/03/18 12:22')]

Write a SELECT statement that returns these columns from the Orders table:
1. The card_number column
2. The length of the card_number column aliased as card_number_length
3. The last four digits of the card_number column aliased as last_four_digits
4. A column that displays an X for each digit of the card_number column except for the last four digits. If the card number contains 16 digits, it should be displayed in this format: XXXX-XXXX-XXXX-1234, where 1234 are the actual last four digits of the number. If the card number contains 15 digits, it should be displayed in this format: XXXX-XXXXXX-X1234. (Hint: Use an IF function to determine which format to use.) This column should be aliased as formatted_number

Sort the result set by the card_number column in ascending sequence.

In [34]:
%%sql SELECT card_number, LENGTH(card_number) AS card_number_length,
		RIGHT(card_number,4) AS last_four_digits,
        IF(LENGTH(card_number) = 16, 
			LPAD(RIGHT(card_number,4),19,'XXXX-XXXX-XXXX-'),
			LPAD(RIGHT(card_number,4),17,'XXXX-XXXXXX-X')) 
        AS formatted_number
FROM orders
ORDER BY card_number;

 * mysql://root:***@localhost/my_guitar_shop
9 rows affected.

[('378282246310005', 15, '0005', 'XXXX-XXXXXX-X0005'),
 ('4012888888881881', 16, '1881', 'XXXX-XXXX-XXXX-1881'),
 ('4012888888881881', 16, '1881', 'XXXX-XXXX-XXXX-1881'),
 ('4111111111111111', 16, '1111', 'XXXX-XXXX-XXXX-1111'),
 ('4111111111111111', 16, '1111', 'XXXX-XXXX-XXXX-1111'),
 ('4111111111111111', 16, '1111', 'XXXX-XXXX-XXXX-1111'),
 ('4111111111111111', 16, '1111', 'XXXX-XXXX-XXXX-1111'),
 ('5555555555554444', 16, '4444', 'XXXX-XXXX-XXXX-4444'),
 ('6011111111111117', 16, '1117', 'XXXX-XXXX-XXXX-1117')]

Write a SELECT statement that returns these columns from the Orders table:
1. The order_id column, 
2. The order_date column
3. A column named approx_ship_date that’s calculated by adding 2 days to the order_date column
4. The ship_date column if it doesn’t contain a null value
5. A column named days_to_ship that shows the number of days between the order date and the ship date add a WHERE clause that retrieves just the orders for March 2018 that have shipped.

Sort the result set by the order_id column in ascending sequence.

In [35]:
%%sql SELECT order_id, order_date, 
	DATE_ADD(order_date, INTERVAL 2 DAY) AS approx_ship_date,
	ship_date,
    DATEDIFF(ship_date, order_date) AS days_to_ship
FROM orders
WHERE ship_date IS NOT NULL AND MONTH(order_date) = 3
ORDER BY order_id ;

 * mysql://root:***@localhost/my_guitar_shop
5 rows affected.

[(1, datetime.datetime(2018, 3, 28, 9, 40, 28), datetime.datetime(2018, 3, 30, 9, 40, 28), datetime.datetime(2018, 3, 30, 15, 32, 51), 2),
 (2, datetime.datetime(2018, 3, 28, 11, 23, 20), datetime.datetime(2018, 3, 30, 11, 23, 20), datetime.datetime(2018, 3, 29, 12, 52, 14), 1),
 (3, datetime.datetime(2018, 3, 29, 9, 44, 58), datetime.datetime(2018, 3, 31, 9, 44, 58), datetime.datetime(2018, 3, 31, 9, 11, 41), 2),
 (4, datetime.datetime(2018, 3, 30, 15, 22, 31), datetime.datetime(2018, 4, 1, 15, 22, 31), datetime.datetime(2018, 4, 3, 16, 32, 21), 4),
 (5, datetime.datetime(2018, 3, 31, 5, 43, 11), datetime.datetime(2018, 4, 2, 5, 43, 11), datetime.datetime(2018, 4, 2, 14, 21, 12), 2)]

Create a view named customer_addresses that shows the shipping and 
billing addresses for each customer.

This view should return these columns from the Customers table: 
customer_id, email_address, last_name and first_name.

This view should return these columns from the Addresses table: 
bill_line1, bill_line2, bill_city, bill_state, bill_zip, 
ship_line1, ship_line2, ship_city, ship_state, and ship_zip..

In [36]:
%%sql CREATE OR REPLACE VIEW bill_addresses AS        
	SELECT customers.customer_id, email_address, last_name, first_name,
		line1 AS bill_line1, line2 AS bill_line2, city AS bill_city, 
		state AS bill_state, zip_code AS bill_zip    
		FROM customers
			JOIN addresses ON customers.billing_address_id = addresses.address_id;
            
CREATE OR REPLACE VIEW ship_addresses AS
SELECT	customers.customer_id, line1 AS ship_line1, line2 AS ship_line2, city AS ship_city, 
    state AS ship_state, zip_code AS ship_zip   
	FROM customers
		JOIN addresses ON customers.shipping_address_id = addresses.address_id;
        
CREATE OR REPLACE VIEW customer_addresses AS
	SELECT bill_addresses.customer_id, email_address, last_name, first_name,
		bill_line1, bill_line2, bill_city, bill_state, bill_zip,
        ship_line1, ship_line2, ship_city, ship_state, ship_zip
	FROM bill_addresses JOIN ship_addresses
		ON bill_addresses.customer_id = ship_addresses.customer_id;
        
SELECT * FROM customer_addresses;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
0 rows affected.
0 rows affected.
8 rows affected.

[(1, 'allan.sherwood@yahoo.com', 'Sherwood', 'Al', '21 Rosewood Rd.', '', 'Woodcliff Lake', 'NJ', '07677', '100 East Ridgewood Ave.', '', 'Paramus', 'NJ', '07652'),
 (2, 'barryz@gmail.com', 'Zimmer', 'Barry', '16285 Wendell St.', '', 'Omaha', 'NE', '68135', '16285 Wendell St.', '', 'Omaha', 'NE', '68135'),
 (3, 'christineb@solarone.com', 'Brown', 'Christine', '19270 NW Cornell Rd.', '', 'Beaverton', 'OR', '97006', '19270 NW Cornell Rd.', '', 'Beaverton', 'OR', '97006'),
 (4, 'david.goldstein@hotmail.com', 'Goldstein', 'David', '1374 46th Ave.', '', 'San Francisco', 'CA', '94129', '186 Vermont St.', 'Apt. 2', 'San Francisco', 'CA', '94110'),
 (5, 'erinv@gmail.com', 'Valentino', 'Erin', '6982 Palm Ave.', '', 'Fresno', 'CA', '93711', '6982 Palm Ave.', '', 'Fresno', 'CA', '93711'),
 (6, 'frankwilson@sbcglobal.net', 'Wilson', 'Frank Lee', '23 Mountain View St.', '', 'Denver', 'CO', '80208', '23 Mountain View St.', '', 'Denver', 'CO', '80208'),
 (7, 'gary_hernandez@yahoo.com', 'Hernandez', 'Gary', '3829 Broadway Ave.', 'Suite 2', 'New York', 'NY', '10012', '7361 N. 41st St.', 'Apt. B', 'New York', 'NY', '10012'),
 (8, 'heatheresway@mac.com', 'Esway', 'Heather', '291 W. Hollywood Blvd.', '', 'Los Angeles', 'CA', '90024', '2381 Buena Vista St.', '', 'Los Angeles', 'CA', '90023')]

Create a view named order_item_products that returns columns from the Orders, Order_Items, and Products tables.

This view should return these columns from the Orders table: 
order_id, order_date, tax_amount, and ship_date.

This view should return the product_name column from the Products table.

This view should return these columns from the Order_Items table: 
item_price, discount_amount, final_price (the discount amount subtracted from the item price), 
quantity, and item_total (the calculated total for the item - quantity * price).

In [37]:
%%sql CREATE OR REPLACE VIEW order_item_products AS
	SELECT orders.order_id, order_date, tax_amount, ship_date,
		product_name,
		item_price, discount_amount, item_price - discount_amount AS final_price,
		quantity, quantity * (item_price - discount_amount) AS item_total
	FROM orders 
		JOIN order_items ON orders.order_id = order_items.order_id
		JOIN products ON order_items.product_id = products.product_id;
        
SELECT * FROM order_item_products;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
12 rows affected.

[(1, datetime.datetime(2018, 3, 28, 9, 40, 28), Decimal('32.32'), datetime.datetime(2018, 3, 30, 15, 32, 51), 'Gibson Les Paul', Decimal('1199.00'), Decimal('359.70'), Decimal('839.30'), 1, Decimal('839.30')),
 (2, datetime.datetime(2018, 3, 28, 11, 23, 20), Decimal('0.00'), datetime.datetime(2018, 3, 29, 12, 52, 14), 'Yamaha FG700S', Decimal('489.99'), Decimal('186.20'), Decimal('303.79'), 1, Decimal('303.79')),
 (3, datetime.datetime(2018, 3, 29, 9, 44, 58), Decimal('89.92'), datetime.datetime(2018, 3, 31, 9, 11, 41), 'Gibson SG', Decimal('2517.00'), Decimal('1308.84'), Decimal('1208.16'), 1, Decimal('1208.16')),
 (3, datetime.datetime(2018, 3, 29, 9, 44, 58), Decimal('89.92'), datetime.datetime(2018, 3, 31, 9, 11, 41), 'Rodriguez Caballero 11', Decimal('415.00'), Decimal('161.85'), Decimal('253.15'), 1, Decimal('253.15')),
 (4, datetime.datetime(2018, 3, 30, 15, 22, 31), Decimal('0.00'), datetime.datetime(2018, 4, 3, 16, 32, 21), 'Gibson Les Paul', Decimal('1199.00'), Decimal('359.70'), Decimal('839.30'), 2, Decimal('1678.60')),
 (5, datetime.datetime(2018, 3, 31, 5, 43, 11), Decimal('0.00'), datetime.datetime(2018, 4, 2, 14, 21, 12), 'Washburn D10S', Decimal('299.00'), Decimal('0.00'), Decimal('299.00'), 1, Decimal('299.00')),
 (6, datetime.datetime(2018, 3, 31, 18, 37, 22), Decimal('0.00'), None, 'Washburn D10S', Decimal('299.00'), Decimal('0.00'), Decimal('299.00'), 1, Decimal('299.00')),
 (7, datetime.datetime(2018, 4, 1, 23, 11, 12), Decimal('0.00'), datetime.datetime(2018, 4, 3, 10, 21, 35), 'Fender Stratocaster', Decimal('699.00'), Decimal('209.70'), Decimal('489.30'), 1, Decimal('489.30')),
 (7, datetime.datetime(2018, 4, 1, 23, 11, 12), Decimal('0.00'), datetime.datetime(2018, 4, 3, 10, 21, 35), 'Fender Precision', Decimal('799.99'), Decimal('240.00'), Decimal('559.99'), 1, Decimal('559.99')),
 (7, datetime.datetime(2018, 4, 1, 23, 11, 12), Decimal('0.00'), datetime.datetime(2018, 4, 3, 10, 21, 35), 'Ludwig 5-piece Drum Set with Cymbals', Decimal('699.99'), Decimal('210.00'), Decimal('489.99'), 1, Decimal('489.99')),
 (8, datetime.datetime(2018, 4, 2, 11, 26, 38), Decimal('0.00'), None, 'Tama 5-Piece Drum Set with Cymbals', Decimal('799.99'), Decimal('120.00'), Decimal('679.99'), 1, Decimal('679.99')),
 (9, datetime.datetime(2018, 4, 3, 12, 22, 31), Decimal('0.00'), None, 'Fender Stratocaster', Decimal('699.00'), Decimal('209.70'), Decimal('489.30'), 1, Decimal('489.30'))]

Create a view named product_summary that uses the same table you used in in exercise 2. 
This view should return summary information about each product.
Each row should include product_name, 
order_count (the quantity of the product that has been ordered) and 
order_total (the total sales revenue for the product).

In [38]:
%%sql CREATE OR REPLACE VIEW product_summary AS
	SELECT product_name, COUNT(*) AS order_count, SUM(item_total) AS order_total
		FROM order_item_products
		GROUP BY product_name;
        
SELECT * FROM product_summary;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
9 rows affected.

[('Gibson Les Paul', 2, Decimal('2517.90')),
 ('Gibson SG', 1, Decimal('1208.16')),
 ('Rodriguez Caballero 11', 1, Decimal('253.15')),
 ('Yamaha FG700S', 1, Decimal('303.79')),
 ('Washburn D10S', 2, Decimal('598.00')),
 ('Fender Stratocaster', 2, Decimal('978.60')),
 ('Fender Precision', 1, Decimal('559.99')),
 ('Ludwig 5-piece Drum Set with Cymbals', 1, Decimal('489.99')),
 ('Tama 5-Piece Drum Set with Cymbals', 1, Decimal('679.99'))]

Create a view named best_products that uses the same table you used in in exercise 3. 
The view should have the same columns returned. 
The view should only return the five best selling products by order_total.

In [41]:
%%sql CREATE OR REPLACE VIEW best_products AS
	SELECT * FROM product_summary
    ORDER BY order_total DESC
    LIMIT 5;

SELECT * FROM best_products;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
5 rows affected.

[('Gibson Les Paul', 2, Decimal('2517.90')),
 ('Gibson SG', 1, Decimal('1208.16')),
 ('Fender Stratocaster', 2, Decimal('978.60')),
 ('Tama 5-Piece Drum Set with Cymbals', 1, Decimal('679.99')),
 ('Washburn D10S', 2, Decimal('598.00'))]

Write a script that creates a stored procedure named test. 

This stored procedure should declare a variable and set it to the count of all products in the Products table. 
 
The procedure should return a 1 row, 1 column result  set with a column named result. If the count is greater than or equal to 7, the stored procedure should return the value “The number of products is greater than or equal to 7”. Otherwise, it should return the value “The number of products is less than 7”

In [73]:
%%sql DROP PROCEDURE IF EXISTS test_7;

CREATE PROCEDURE test_7()
BEGIN
	DECLARE product_count_var INT DEFAULT 0;

	SELECT COUNT(*) 
	INTO product_count_var
	FROM products;
    
    IF product_count_var >= 7 THEN
		SELECT 'The number of products is greater than or equal to 7' AS result;
	ELSE
		SELECT 'The number of products is less than 7' AS result;
	END IF;
    
END;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
0 rows affected.

[]

In [53]:
%sql CALL test_7();

 * mysql://root:***@localhost/my_guitar_shop
1 rows affected.

[('The number of products is greater than or equal to 7',)]

Write a script that creates and calls a stored procedure named test. 

This stored procedure should create a cursor for a result set that consists of the 
product_name and list_price columns for each product with a list price that’s greater 
than $700. 

The rows in this result set should be sorted in descending sequence by list price.

The procedure should return a 1 row, 1 column result set with a column named result.

The procedure should set the return value to a string variable that includes the product_name
 and list price for each product so it looks something like this:
 
*Gibson SG*,*2517.00*|*Gibson Les Paul*,*1199.00*|
Here, each value is enclosed in asterisk(*), each column is separated by a comma (,) 
and each row is separated by a pipe character (|).

In [83]:
%%sql DROP PROCEDURE IF EXISTS test_9;



CREATE PROCEDURE test_9()
BEGIN
	DECLARE product_name_var VARCHAR(400);
    DECLARE list_price_var DECIMAL(9,2);
    DECLARE s VARCHAR(400) DEFAULT '';
    DECLARE row_not_found TINYINT DEFAULT FALSE;
    
    DECLARE product_cursor CURSOR FOR
		SELECT product_name, list_price FROM products
        ORDER BY list_price DESC;
	
    DECLARE CONTINUE HANDLER FOR NOT FOUND
		SET row_not_found = TRUE;
        
	OPEN product_cursor;
    
    WHILE row_not_found = FALSE DO
		FETCH product_cursor INTO product_name_var, list_price_var;
        
		IF list_price_var > 700 THEN
        SET s = CONCAT(s, '*',product_name_var, '*',',','*', list_price_var,'*', '|');
        END IF;
	END WHILE;
    
    CLOSE product_cursor;
    
    SELECT s AS result;
    
END

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
0 rows affected.

[]

In [84]:
%sql CALL test_9();

 * mysql://root:***@localhost/my_guitar_shop
1 rows affected.

[('*Gibson SG*,*2517.00*|*Gibson Les Paul*,*1199.00*|*Fender Precision*,*799.99*|*Tama 5-Piece Drum Set with Cymbals*,*799.99*|*Yamaha DGX 640 88-Key Digital Piano*,*799.99*|',)]

Write a script that creates a stored procedure named test. 

This procedure should attempt to insert a new category named “Guitars” into the 
Categories table. 

The procedure should return a 1 row, 1 column result set with 
a column named result. 
If the insert is successful, the procedure should return the value:
1 row was inserted.

If the update is unsuccessful, the procedure should return the value:
Row was not inserted - duplicate entry.

In [85]:
%%sql DROP PROCEDURE IF EXISTS test_10;



CREATE PROCEDURE test_10()
BEGIN
	DECLARE duplicate_entry TINYINT DEFAULT FALSE;
    
    DECLARE CONTINUE HANDLER FOR 1062
		SET duplicate_entry = TRUE;
        
	INSERT INTO categories VALUES(1, 'Guitars');
    
    IF duplicate_entry = TRUE THEN
		SELECT 'Row was not inserted - duplicate entry.' AS message;
	ELSE 
		SELECT '1 row was inserted.' AS message;
	END IF;

END;

 * mysql://root:***@localhost/my_guitar_shop
0 rows affected.
0 rows affected.

[]

In [86]:
%sql CALL test_10;

 * mysql://root:***@localhost/my_guitar_shop
1 rows affected.

[('Row was not inserted - duplicate entry.',)]